[
  {
    "title": "I, Caesar: Spaceman",
    "date": "January 21, 2013",
    "body": "<p>I. </p><p>In late 2008, in a field southwest of Alexandria, Egypt, a hidden chamber was discovered underneath a hill on the outskirts of the Sahara. When researchers opened the chamber, the discovery would change human history as it was known. </p><p>This is story is a dramatization of a single scroll from that chamber. Barely legible and utilizing multiple languages, some dead, others ancient, the scroll was parsed over the course of a international effort to unravel it’s mysteries. Whether it was legend, lost mythology, or a historic forgery, what was described and later told here, could be the greatest discovery of mankind. </p><p>With the formation of the First Triumvirate, Caesar had designed the Roman political landscape to his desire. It was within the first year of this arrangement that this story takes place. Caesar sought the greatest mind’s Rome had to offer. He took council with only his closest two or three advisors. He had a vague, rough plan which had hatched in his mind. He knew exactly where the seed had been planted.</p><p>It was during his second campaign against the barbarians in southern Gaul that he had the premonition. With his legions fighting a horde within his view, he remarked at how brightly their fire slings were from that distance. Across the field, below the generals vantage point, the Barbarian miscreants flung smoking and exploding slings at his shielded disciplined legionnaires. His advisors had not remarked on their military abilities, nor had caesar observed such a remarkable military feat in his campaigns. Indeed their slings were twice propelled the distance of even the most skilled sling troops Rome had ever possessed. The night after the skirmish, Caesar requested a private audience with a captured slinger. </p><p>It was after this meeting, and subsequently when Caesar returned to Rome that he began his remarkable quest. When he spoke to advisors in private, he would only do so on quieted voice, and with the utter care not to tell all of his plan to one man. Indeed, everyone involved in gathering the minds needed, knew only what was necessary to complete their part of Caesar’s grand scheme. He relied on the greatest discretion, and the most prominent thinkers to bring that scheme to fruition. </p><p>He chose a prefect outside of Rome to conduct meetings of these thinkers. Outside of Rome, and it’s influences he could force the citizens into submission at his will in order to maintain secrecy. He first inquired to Rome’s greatest philosopher at the time, Himenclitus, knowing that holding him amongst his ranks would recruit others by sheer reputation alone. </p><p>Himenclitus found the initial invitation mysterious, typical he thought of a newly engrained power, to obscure their true meaning. Yet upon meeting the general he was swayed by his eloquent approach and without demur he was the first member of the team. He was not the last, and as the group was formed and meeting the full scope of their ability would be tested by Caesar. </p><p>The metallurgist, Marius Homeus was the finest engineer of his age. During the cold winter campaign in the north, the teuton barbarian’s amassed their forces just beyond the legionnaire's bow, and further inland than their war machines range over the river. Homeus knew that they would never be defeated until the legionnaires were able to cross the river and close the gap. Once propositioned for a solution, Homeus worked tirelessly for a method of the army to cross, efficiently, and quickly. Although not immediately apparent to Homeus, on the 3rd day Homeus had a remarkably elegant solution for Caesar. When the army approached the river under the cover of darkness, Homeus and his aides laid the groundwork for their arrival. He fashioned a flexible metal  walking canopy to rest atop the ice. It was flexible, but of a peculiar hue and in-malleable once colder. As he had only moments to set the bridge it would become as strong as the soldiers sword, he worked quickly and diligently, as to make ready for the legion, and to remain concealed as much as possible to the enemy. Homeus was prominent in Caesar’s returning triumph that spring. Featured among the golden chariots, and given a preeminent seat during the subsequent games. </p><p>The prefect was operating under the auspices of plague when Homeus and the others began gathering. Their fellow Romans sequestered in their homes most of the day and with such limited activity or venturing, their meetings were successfully held to citizen rumors and common granary meetings. Though rabble and local mob had no idea what the men at the edge of town were planning, neither did many of those men upon first meeting. It was this that was according to Caesar’s design. Secrecy was among his numerous tools in regards to this pet project.</p><p>When the mathematician and philosopher Quantus was approached by Roman Legionnaires, he was working on a proof of his double bounded problem. Although his work is now lost, it was written that at the time, that particular problem was that which Archimedes had discovered, and was mistakenly killed for. Quantus was well respected when Caesar’s men basically kidnapped him, escorted him north from his Sicilian home and study. They rode past the outskirts of Rome, the tension and moneylenders like the ancient She-Wolf herself circling the city. Indeed Quantus had to obscure his face to hide his own identity, as he recognized a few of the well known tax collectors. As he was a perfection with mathematics, he did not believe in coinage or currency at all. From his appearance and health, his eccentricity with money was not well hidden. </p><p>Quantus was quiet upon first entering the gather the first night. With their objective and leader absent, the men took up to arguing attempting escape. Ofelius, a lesser known poet and scholar of the day, would promise his fellow enigmatic participants that he knew all too well what was going on. After a slur, then discouragement from his oldest friend Artemer, he told the rabble of their objective. When all the participants had quieted and gathered, many recently introduced and already uncouth acquaintances, Ofelius told that he knew the Triumvirate convened them for a matter of Rome’s glory. </p><p>As Ofelius was not wholly inaccurate, the group agreed amongst themselves. These, the brightest of Roman thinkers, had suspected the likes of Hannibal, to murder them. To deprive Rome of it’s potential glory and honor. One of the Legionnaire had spoken of the reasons to Homeus and Verus, and although he had spoken similar to Ofelius, the ultimate reason was still mysterious.</p><p>Next to Ofelius stood the Roman architect Lucius Verus. Famous for his wit and concentration, he had designed Caesar’s granary. A problem which no other conscripted design could withstand. Lucius had prominently built a trussed structure to hold the supply for not just Caesar, but the surrounding area. But that was years ago, and Caesar’s only memory of him. Since then he had built numerous villas for his rich families’ purposes, built the Venician Forum, and solved the double weight paradox. Growing older and weaker now than all the others, Caesar hoped to rely on him for wisdom and insight through his proposition. </p><p>Even the mystical soothsayer of Estruscia was asked to join the amalgam of minds. He along with a dozen other trusted engineers, mathematicians, and philosophers gathered in that villa on that night. The momentous occasion spawned much the speculation and inclination of the local romans, many loyal electorate of Caesar himself. When Caesar himself arrived the meeting of the minds took a very serious and stalwart turn.</p><p>II. </p><p>The group of thinkers gathered 15 miles from the heart of Rome were restless. They had been brought to a innocuous Villa on the outskirts of the town, past the main crosswords westward. It’s owner had been persuaded to leave by praetorians a day earlier, motivated by a handsome sum of gold. The rabble of great minds had been arguing and discussing their purpose. Some correctly knew Caesar was on his way. Others were as in the dark as their correspondence and legionnaires were. </p><p>Caesar, meanwhile was indeed on his way. Ardently dividing the workload of his respective thinkers. With some knowing pieces, and others none at all. Caesar is reciting letters and diplomatic dealings to his aides two or three at a time. His workload not diminished nor slowed through his serious efforts on the papers he himself worked on. On his own mind, which experts to devise which aspect of his plan. Who should know what. </p><p>Overall construction and design, he felt, should be overseen by himself and Himenclitus. As his the most respected, and the initial invitee. These would sway Caesar’s decision to consult him as his direct underling in regards to the plan. Besides his technical ability, which was said to be the greatest of all the republic and the unconquered empires, Himenclitus could recall any wishes of the god’s that Caesar needed to align with. </p><p>When he arrived, he ordered his aides and legionnaires to create a perimeter around the Villa. He arose great respect upon entering through the slave quarters. All within stood and acknowledged the great generals entrance. With the dozen or so philosophers, mathematicians, metaphysicians and their highest students in full captivity of him, Caesar spoke with a resolute tone.</p><p>“Welcome friends. What we accomplish here. What you will achieve. Will glorify Rome for all time.” Caesar held their full attention through their agreement and adoration. As many had observed before in his public speeches, Caesar could implant any idea into the mind of those listening, as if it were their own. </p><p>After further introduction and speech crafting, Caesar split the whole into three groups. He sequestered them to different rooms. The first Quantus, Ofelius, Artemer and numerous others were told to wait for him in the master quarters. Verus, his assistant, and Aquillius the younger were told to stay put for further instruction. All the rest, Homeus and the like were taken to the luscious bath at the end of the Villa. </p><p>Caesar himself spoke to Himenclitus at some length. After the groups had been partitioned. He spoke to Verus’s gang of 5 who had not left first. </p><p>“Verus, I have a great problem for you to solve. You are the greatest architect and builder my age has ever known. Even I enjoy your great designs every day at my home in Rome. Your columns and arches have never fallen in their history. All your ability, will be necessary to bring my plan to reality.”</p><p>Caesar spoke with a fervor and reverence many had not seen from their candid leader. He was sincere and honest when laying out the problem. He had fashioned ideas of the same problem during the trip from the city. The problem was simple. Design a craft to hold explosives, yet not explode. Verus was tasked, considering his mathematical conceptions of structure, to design Caesar’s unheard of craft to survive an explosion, yet also be the explosion. With his assistant and numerous other help, Verus was initially appalled at such an idea upon initial revelation. </p><p>“Impossible Caesar.” Verus retorted after Caesar laid out his idea. “For a fire to burn, it has to consume the entire source. Even metal and coin would be consumed in any sufficient flame.”</p><p>“Even if the flame is obstructed outward?” Caesar inquired Verus. </p><p>Verus’s assistant would later respond that his teacher had greater rate of failure than he did success. With Caesar’s problem and task brought to the design team’s attention, he left them to seed another group.</p><p>Further down the hall, Caesar discussed the other aspect of his plan. The bath was started before they had arrived, and with the misty obscurity of sight. The friends spoke and sometimes hadn’t an idea of who they were talking. Caesar spoke to their blind delight. </p><p>“It is typical of Homeus to begin the bath. We haven’t much time tonight and this damp is soaking my cloak so let me be brief. Tomorrow I will introduce to your minds a substance which can burn at an incredible heat. It can propel a single stone twice or three times the distance of our catapults. I want you to create a mechanism to harness this flow. To be able to point it, and control it.”</p><p>“Caesar, what is this for?”</p><p>“All will be revealed Homeus. All will be revealed. This is the beginning.” Caesar then spoke of the incredible heat and force from this fire. The same he had observed and brought from the north. Homeus, the genius metallurgist, listened intently, and knew what Caesar was asking. The impossible. As Caesar left, the men, sitting around the bath house, sweating and exhausted, laughed and smiled at their naive leader.</p><p>Although Caesar must have heard this as he and Himenclitus left, they spoke even more optimistically to the final group. Quantus, Ofelius, and Artemer were sprawling in the master’s quarters. Or more precisely the old master’s quarters. They sat up and all the men sat simultaneously with Caesar, who was quite tired at this hour. He thanked the men for their help and patience. </p><p>Quantus was asked if it was possible to go to the gods. If the sky was so large as to never end. </p><p>“As the stars are fixed at equidistance from the Earth, Caesar, you could reach them at equal time. If you could travel there that is.” </p><p>Caesar would later adjourn the meeting, and inform all the groups that their quarters were nearby. Along with readings and personal writings and instructions from Caesar himself. All were placed under constant guard. All seriousness and sincerity returned the men from the bathes as they realized Caesar was indeed serious. He would show them a flame which burned as hot and as long as the sun. </p><p>III. </p><p>Cassius was helping his wife with a personal matter when the light shown, and the house shook. Neither realized what had occurred. Both moved through the slave chambers, which had emptied to work the fields, and then further through the courtyard to find the source of the afternoon disturbance. It was Cassius who spotted the smoke before his wife, pointing and running over the southwardly hill they saw the trail. A vibrant black flame worked its way through the cloudy Corsican day. The harvest was year, and thus sight over the hill was not a viable option. He and his wife assured the workers that nothing was alarming, although neither knew for sure, allayed their fears then pursued the end of the smoke trail. </p><p>They ran through the field of crop, stalks as high as Cassius, and blooming as high as his wife. The smoke was trailed over successive hills until they reached the coast. The ocean air and waves regulated the sound of the moving grass. The smoke was broken into a y toward the ocean horizon. Cassius ran to the beach to acquire an unfettered view. He saw the trail from the clouds. He confirmed it was split into a distance apart and far away he could not determine. His wife called to him from the cliffs north of the beach.  </p><p>She stood over a large slender slab of smoking metal. It was lodged into the ground surrounded by charred earth. Shimmered and broken, the end protruding from the ground had a unique sheen that Cassius’s wife had not observed before. Further beyond the cliff dangling over the rocks was another shimmering piece of metal. Her husband would later hold the two, reunited, and show his wife that they were in fact apart of the same apparatus. </p><p>Inland from the cliff were scattered metals, glasses, and organics. It was a peculiar pattern upon the Cassius grounds. Although smaller parts were found in increasing radii from the metal found on the cliff, they would observe that each of the debris fields contained unique pieces of something grander. Fitting them together a pair at a time would be impossible without foreknowledge of the whole design. Despite this, Cassius concluded later that night that they were indeed from the same machine. Even he would admit that this was a stretch in logic. He was an intelligent man, a tradesman, farmer, landowner and veteran of the campaigns of the north. A scar through his right arm was a reminder of that misadventure. </p><p>The north slope by Cassius’s villa would become the beehive of his neighbors attention. With nearby farmers and landowners visiting out of the blue, later to be revealed as artifact gawkers. A day after observing the streak through the sky, Cassius and his wife would inventory and collect a growing collection of the objects. Most objects came in deformed, charred, discolored. Yet under the burned surfaced one could reveal the vibrant and unique metals and glasses.  One long piece of blackened metal was polished to it’s original appearance. Cassius exclaimed upon realizing what he found. The metal itself was malleable, yet nearly opaque in color. Soft to touch, yet easy to bend, but also remarkably resistant to break or splitting. Indeed all the slaves combined force couldn’t break the piece. </p><p>When the praetorian began asking questions, Cassius and his wife were sufficiently afraid. They knew the objects were of a unique origin, but also both thought of the rather sizable debt they had owed in taxes. It had accumulated in as an imprecise time and place as it was a sum. Although not a tax collector in their region, the praetorian was particularly harsh to unpatriotic romans. He inquired at length of the pieces, theirs origins, and prescription for disposal. It was at this last point that Cassius refused further entry and questions. </p><p>A day after the praetorian was ejected from the Cassius homestead a caravan of individuals, none known, approached. Indeed some legionnaires among them, others more dignified and obscured in profession. They rode into the Corsican sun and approach Cassius with Rome’s bidding. Word had reached rome of a unique find and strange mystics partook to elevate these occurrences to illustrious heights. Cassius and his wife were not subjected to harassment or any such torture at these prestigious hands. All who came forth from the caravans and subsequent groups only sought possession of the various objects, and their silence. A deal which cassius heartedly agreed to on condition of full forgiveness of debts. </p><p>It would later be on record as the mysterious circumstances of Cassius’s reenlistment, and then six months later his vanished wife. Some would find the soothsayers purpose to be true in these situations, for those who find the mysterious, often live enigmatically. </p><p>The same praetorian, who not a year earlier had been removed from the Cassius home, would later purchase the seaside villa and estate. Repurpose it, declare the fields baron, and remove all slaves and hired hands from their quarters. It was Rome’s then, and hers to do with as she saw fit. </p><p>IV.</p><p>“Damn it!” Himenclitus yelled after the newest variation of the Diamond exploded. He and Artemer had rigged a delayed reaction to ignite so that they could run behind the Corsican tree on the far side of the hill. They had all the reason to be joyous cheerful men. Their first half dozen trials had all slowly been building to this moment. A full ignition of the entire device on the ground. Held in place with thrust to one side instead of at the ground. </p><p>Ofelius would later examine the wreckage and gather the pieces. Further up the embankment the local tenant had growing suspicious of the concussive sounds. “What was his name?” Ofelius pondered to Artemer the next day. </p><p>“I think it’s Cassius, I could be mistaken though.” Artemer looked down at the schematics drawn out in the sand by Verus from moments before. It followed an ideal time that the Diamond could burn before it ignited the whole of the Flame. It was a fine Corsican day, and with Caesar demanding a trial the next day, none would sleep that night. </p><p>Indeed the amount debris and destruction on that same testing ground was astounding. Not less than 3 ships had been brought to shore by it’s tremendous light. With those and Cassius’s departure the secrecy was maintained. As they were told not to discuss all their workings together, all had significant gaps in the overall plan, but Himenclitus. He had a potential solution. A solution he would later attribute to Artemer for his observation during one of the tests. </p><p>As it was custom to burn the device for short controlled intervals, skins of recently killed animals were strewn around the light during a burn. Once Artemer noticed that a tied skin could hold heated air, and that it was raised from the ground. Himenclitus was not far behind in putting the summation of thinking to work. As a flam would be unstable to launch from the ground, it would be necessary after flight had been achieved. When Caesar heard Himenclitus’s idea, the whole of the next week was at work on another device to trap heated air.</p><p>V. </p><p>“Julius, as no one has gone this high before, we can say that the Alps height produces distinct mental failings. We do not wish for you to faint at such height. Therefore you must close and lock the binding on the top here.” Artemer said pointing to the leather straps above Julius. “As the air becomes thinner, close it, but not too soon as you won’t have enough air to survive the journey. Yet also. Binding the lid too late and you will be unable to bind at all, black out, and most likely lose all ability. The time must be perfect. Precise. Until that moment your rise should be steady and speed as you go higher than Mt. Vesuvius.” </p><p>The small group of men gathered just after sunrise. They were sworn by blood oath to the man strapped into the diamond shaped contraption of glass, metal and animal hide. All the months of preparation and testing had led to this moment. Their leader, a man so fearless in all his endeavors had undertaken at his own bodily wellbeing. Artemer had given Julius those instructions roughly a dozen times with the latest counting as 14th or 15th. The bags of air surrounding the enclosure could hold to their calculations, 4 hours of air for a healthy man. Perhaps 3 for a Roman.</p><p>Ofelius worked on the balloon of sheep skin and ox intestine. Patching leaks and overlaying more ox blood to seal those. All were busy and nervously lending their final thinking to the grand endeavor. Homeus worried of the bindings to protect Julius. </p><p>“They are fair, Homeus, or you are not.” Ofelius said with a smile. Patting him on the back, Ofelius found his old friend and teacher at a fragile state. “When Julius is back with to Earth, you will be the triumph of Rome. Held highest among the scholars of the Roman academies.” Homeus was not as assured as Ofelius was. He looked over every binding and bolt. Every crease and crevice. He knew the enclosure could withstand any impact. Indeed the Parthenon served as a suitable peak to drop the 6 foot enclosure from. The mere fact of surviving that was a feat worthy of accolades. A cracking of the glass, and splitting of the underlying wood could still sully Julius’s death. </p><p>“Homeus, the metal is impervious to man’s doing. There is no situation for you to break it or severely deform it.” Ofelius said, with concurrence from Artemer. </p><p>“It is not man that worries me. Julius is to visit the Gods.” Saying this, Homeus was successful in quieting his fellow scholars. </p><p>Julius sat listening to his fellow Roman’s carry on in this manner. It was a moment of great concentration and meditation. The Diamond that encapsulated him was wrenched open by a crank shaft, a lever set to release, and thus close the wrenching. He thought of when to pull it. The moment of gasping air, and the rush of breathing that accompanied closing, as this lever also opened the tube to his bags of life. Much as his own lungs hungered for the fresh breeze on a summer day, his thoughts hungered for the moments of action. The rest he thought, was out of his control.</p><p>“Around two cycles of air later, after closing the Diamond, you will have to ignite the flame. This will take around 10 minutes to fully burn to the source, but you will have nothing else to do except for this. Once the source ignites you will have to observe the levels and make sure that you do not fire towards to the Earth again. The 2nd test confirmed that it will actually self correct, but the levels are there to guide you.” Lucius Verus pronounced over Artemer’s background discussions with Ofelius. </p><p>The levels themselves rest on the lower portion of the lid. Just under the latches and were nothing more than olive oil in small glass flasks. Verus had designed most of the machine himself, with the fellow builders adding input to adjust when necessary. Levels were his idea, as the thrust from below the Diamond would almost always cause a giant circle to be drawn in the sky. Julius would control the direction of the flame using the stick between his legs. Though this was never tested.</p><p>Quantus, the mathematician, knew that the time and pattern of Julius’s trip would be crucial to recovering him alive. “When the Flame has exhausted, Julius, you will fall with the speed of a rock. Once you see the surface again, that is when you pull the chord. Again, too soon, it will most likely come off due to the time, too late, and you won’t slow yourself.” Quantus has a precise number to tell Julius, but no way the engineers could determine that height from the air. Without a known reference, Julius would be guessing. Quantus did not believe in guesses. </p><p>Neither did the rest of the crew. As air began to fill the balloon and the Diamond and Fire contraptions began to life their own weight, Julius and the rest became quiet. Each knew the previous failures. The destroyed and mutilated contraptions. Julius was smiling and joking however, much as he was in war. Yet strangely his laugh would dissipate after each routine was worked over. A calm servitude lingered in his thinking.</p><p>“I go to visit the Gods.” Julius proclaimed from within the Diamond. “Though they do not expect me, I shall visit them all.” Julius could feel the balloon above him. All the fired air his companions had placed within. He sat within the Diamond. Looking through the glass enclosures at his wearied friends. The brightest of Rome was behind him, and soon to be below him. </p><p>The ground ropes were now feeling tension and pull upward from the contraption. Artemer gave a thumbs up to his fellow philosopher Ofelius, who did the same to Lucius and his assistant. The 50 or so men and assistants all checked and double checked the every component. </p><p>“Cut them,” Ofelius bellowed. With that each one was cut in succession. </p><p>“I go to visit the Gods, and conquer what is theirs.” Julius said as the final tether was released from the ground. </p><p>VI. </p><p>With the last tether cut, the craft rose quickly into the heavens. It was surprising to Julius has small his fellow Romans appeared after only seconds of lift. Indeed Lucius’s balding head, with Ofelius beside him looking up, all became to small to pinpoint after a mere minute or so. The Diamond spun and gave Julius intrepid motion and air sickness as it did. </p><p>Relentless as the craft was, it did provide Julius with the highest perspective of life anyone had observed. The far expanse of the ocean waters. The outline shape of Cassius’s villa, red roofed. The vessels sitting off the coast for his rescue. The sweeping hills of Corsica and melding colors of flower and windswept trees. </p><p>Julius felt the relentless wind and uncommon strain on the balloon above him. The three fingered diameter ropes holding and shaking during the ascent had been assured were strong enough. Julius could see the burning oil fueling the balloon.  The lines coming to the top of the Diamond. The welds holding the contraption together. With twenty minutes of ascent, Julius noted that everything was working. As it were. </p><p>The lever to his right holding strong, the stick between his legs immobile for now. He looked nervously at the curvature of Corsica. The hills, cliffs, and crops of the island were becoming less precise to view. It was as if Julius were a floating bird, able to stop at will. Able to observe the very shape of Earth herself. He could no longer make out the villa below him. With the many homes. The many fires. The many crops and roads darting the land. The Aqueduct to the north of the island, still under construction. Julius’s stomach held strong, despite the constant shaking, turning, and yawing. </p><p>Julius was surprised when he broke the cloud ceiling after just 45 minutes. He was looking down at the time, with the clouds here or there covering the ground. But this was different, as Julius himself was in the white cloud. The white was dull and moist on the glass Diamond in front of him. The balloon above him was holding strong despite the occasional quake of wind. Just as quickly breaching the clouds, he was through the other side and rising high above them.</p><p>Julius was higher still than the cloud cover could pretend. The droplets on the Diamond came through the wedge of open space. They were cold and with the breeze Julius’s wool and sheepskin coat was successful so far in keeping him warm. Though his breath was becoming more visible with the increasing altitude. </p><p>The majesty of the high winds, and the bearing of clouds without soil under his feet, Julius was sufficiently awed. When the barbarians fled two years earlier. Or when the germanic tribe was destroyed through the mountain pass. Even those great victories, those wonderful moments of glory could not compare to the feeling Julius now felt. </p><p>The craft had stabilized and with the smooth uplift over the clouds Julius knew the air was thinning. Much as he felt years ago, his longs strained, and his vision began to find more white spots in view. The clouds were not the problem, nor moisture, as both were far below or intermixed in the distance. The unbearable mid-morning sun shone much brighter through the glass at this height. Although he could barely make it out. Julius had been in the air for two ticks on the Corsican clock at least. The closer he came to pulling the lever, the larger his balloon became, and more it bellowed in the wind.</p><p>He knew the time was coming, but the words of the team still rattled in his preparations. Holding back from pulling the lever, he had his hand on the clutch even though he did not push it forward. His choking and breathing slow, the blackness covering his sight, he closed his eyes. Thought of his role in this endeavor. Thought of his duty, and what any Roman would be proud of. I could count the seconds in his thinking, playing the words over and over again. One. Two. Three. On and on. </p><p>Then a rip. He felt the jolt, heard the pop, and knew immediately he had to act. Julius, eyes still closed, reached above his head for the wooden peg. He felt his ascension slow, even fall perhaps. Time was wasting as he found the top point of the Diamond. He couldn’t find the wood. His hands and fingers feeling what his eyes couldn’t truly focus. Then a familiar feeling. The leather strap attached to the peg brushed the back of his hand. He grabbed ahold with his left hand. Firmly gripped, and knowing this was the moment he knew. Barely close to consciousness. He pulled the peg, and pushed the lever forward.</p><p>When the balloon was unlatched, the air bag had begun it’s circulation and sight was returning slowly to Julius. The lever was closing in the time that balloon was detaching. The turbulent and ascension had stopped for a moment. The weight had evened out for a slow descent. Knowing that he was seconds from a full detachment. Julius reached for the stick in front of him. With the Diamond closing, bags filling it with breathable air again, and the balloon detaching, he lit the Flame. Pulling back on the stick opened the funnels to the bottom exhaust. It was a matter of seconds now. </p><p>Then with a stutter, and a misfire, the Flame finally hit to normal function. The fire and thrust pulled Julius’s back against the Diamond. The balloon detached and the Diamond destabilized and immediately began to rock and sway in any way possible. Julius held the stick, shaking wildly and with more focus to his vision, he worked quickly to level the Diamond. A minute from ignition of the Fire, Julius had stabilized and felt the full thrust of the Alchemical substance. The steady and full shake of the craft was cracking the glass behind his head. He knew the double paned glass could withstand a war elephant standing on it, but heard the breaking. Fear was setting in to Julius’s thinking. He knew he had enough fuel, according to Quantus’s calculations to burn for a full hour, though with the same numbers predicted the bags would lose potency.</p><p>VII. </p><p>Julius held the stick between his legs. Head up through the cracking glass and burning metal. He had seen that his air bags were being deflated and running low a moment earlier. His legs felt like weights on the craft, and his face winced in pain as he looked upward through the blue sky. The sun was brighter and hotter through the crackled class in front of him. The points creating sparkles in his sight. The wood interspaced between the glass panes and the reinforcing metal were holding together.</p><p>The blues began to melt to a black. The white boundary lessoned. Through the single unbroken sliver of glass above him, near the convergence point of the Diamond at the top, Julius could see the blackness, clear blackness beyond. The white line of curvature broken in his view. The blue fading to a deep black. And the constellations beyond. </p><p>The Flame held for another few seconds upon breaking the white plane, sputtered, then fired the last gasp of thrust. Julius felt his feet release from the ground. His rear and back from the straps. His head hit the concave corner of the top, opening a wound. He grasped around with his arms, losing grip of the control stick, yet with the failing Flame, the direction of thrust did not matter.  Julius regained focus and pulled himself into the seat. It was at this moment, that the thrust gave out below him. </p><p>Julius pulled the straps to secure himself to seat. He could feel the weight returning. And the whole contraption, at once, fell toward the Earth. Tumbling and rolling over itself. Growing in speed and pull against the contraption itself. Around a minute after reaching the peak, the cracking and chipping on the outside seals began. Another moment and a bag of air would detach from the contraption. The sinking feeling in Julius’s stomach dislodged his pre-launch meal. He had no choice but to scream in pain and hold on dearly to the seat. </p><p>After nearly ten minutes of pain and lumps in his throat, Julius was impossibly disoriented. The spinning had stopped, and he could make out clouds below him, which was in front of him. Or on second thought, Julius couldn’t tell . The sun was in constant motion, creating no shadow long enough for him to obtain a direction. </p><p>As he was approaching the latch on his right side make a breaking noise. Like the cracking of a giant tree, the wind and slow cracking grew louder. Julius clung to the leather strap, hoping it would stop the ejection of the top half of the Diamond. Holding on he heard the characteristic cracking on his left side. He could observe the other air bags were nearly empty, exhausted of life. As the leather strap in his hand gave loose, the left side gave a catastrophic crack almost immediately afterward. Julius hoped he was in a breathable region. As the Diamond split in two, he could observe as the shell opened that the clouds approached rapidly. The same ceiling that he had risen through not so many minutes before. </p><p>The deafening wind and misconfiguring  resistance pulled at Julius from the seat. As the Diamond was fully ripped off he looked up and saw the top piece break down the middle. Glass panes releasing finally from the wooden skeleton and metal reinforcements. Julius held the seat and tightened the straps holding him. He suddenly was plunged into white. Engulfed and screaming, Julius tasted the water on his lips. He counted going through, and counted the reverse. Five minutes quicker to fall through. </p><p><sup></sup><br></p><p>As he broke the through the cloud he reached he reached under his seat. Feeling around he first thought his object was missing. But he eventually found the baton tied to the under-seat. He broke the top and released the baton above him. He looked up to confirm it had worked. After an initial doubt, the streaming red smoke of the remaining Flame streaked above him.</p><p>Julius knew he had to pull a chord as Quantus had told him. He knew it was on the left side of the Diamond, near his feet. Though he did not see it. Not under his feet. Nor under his seat. Julius thought he was so discombobulated to have no idea which end was which. He closed his eyes and concentrated counting to an acceptable number to survive. Five. Upon opening his eyes he saw the chord of rope between his feet. He grabbed for feeling a pull against his arm. It was at this point that he beheld the pure rush of a growing earth. The ocean below him now easily the same size as when he’d launched and 10 minutes passed. With his thinking on his speed, he figured he had around two minutes to pull the chord. Any more would not slow him enough. Julius regrouped his strength and reached down once more. This time constrained by seat strap binding him to the backing. With his opposite hand he untethered a part of the harness holding it firmly in his arm. He got it. Pulled. With the wind Blanket open the fall slowed and stopped it’s horrible tumble once and for all. The last remnant of the Flame still attached by a long rope, with the Blanket’s tethers shorter. </p><p>As the turbulence and wind bellowed around him, Julius’s heart and breathing began to lesson. The water below, blue and rippled, reminded him of the top of the Earth. He could spot land from this height, even though he thought he glimpsed it a few moments before. With the slowing speed, the capsule made a jolting and surprising impact with the water. The sloping waves immediately flooded the remaining diamond. Julius quickly removed himself into the water and strode away from the sinking contraption. As the Blanket and and Flame sank with the other wreckage, Julius pulled free the remaining air bag, clinging for life in the bobbing water. He looked up from his back, still disoriented, and saw the streak of red smoke to his position. As the wind pushed the smoke away he became overwhelmed by his predicament. </p><p>Yet his fears would quickly cede to relief, as a sail was approaching over the midday horizon. Julius looked past the smoke, further past the clouds, to the sky he had just fallen from. </p><a href='#/fiction'>fiction</a>"
  },
  {
    "title": "Inanimate Killer Object",
    "date": "November 04, 2011",
    "body": "<p>11:16 am. Norman, OK. AFPK Plastics. Injection mold 23. Shift 3. Pellets in place. Inject button. Blinking.</p><p>“Darren?!” Said Rob coming around the corner from the cafeteria. He leans against the plastic work station, across from Darren who is overseeing the machinery’s panels of large dials and circular buttons. </p><p>“Yo?” Replied Darren. Rob then gives him a motion for lunch, waving his arms toward the cafeteria. “Yah one second. I just have to finish this run.”</p><p>Darren turns to the panel. Seeing the blinking query from the computer which is anxious to finish it’s programming, Darren presses the button without realizing the larger consequences of doing so. He couldn’t have known. He just wanted lunch. </p><p>Injection sequence +0.05 seconds. Pressure 5k psi. Temperature 500 degree F. Injection sequence +0.07 seconds. Pellet conglomerate formed. Falling. </p><p>As Darren goes off to lunch, Peggy is working down the line. She is on the inspection side of the process now, just pulled over from machinery maintenance. She is slender and well liked, typical of a high school girl who had to support kids on her own. She handles the toy car for only a moment, fresh out of high heat and pressure, yet now cool to the touch. </p><p>Peggy removes an imperfection from the side of a door, and then polishes a speck of discoloration off the hood. She places the car back on the line without knowing either. It is rolled into another car, and then settled onto the conveyor belt, peacefully. </p><p>Down line 3. Over another belt. Through a bath of red color. Dried. Fixed with wheels. Finished.</p><p>Bobby is responsible for boxing. His job is to place the plastic car into its display packaging and then its final box. After he does just that, his friend Jenny runs the forklift, reversing the typical male-female role, and places the pallet with the car in it onto the semi truck. Destination: Your local Wall World. </p><p>The morning after the truck drops off the AFPK products at Wal-Mart, your son comes to your cart, showing you the red toy car saying that he wants this one. It’s a simple enough design. Larger than the toy metal ones, more cartoonish, rubber tires, and details that might surprise you. </p><p>“How come this one is different than what you wanted before?” You ask, simply enough to your over-wanting son. He looks back, puzzled. Looks at the floor. The car. And then you again. </p><p>“Because this one is different.” He says shortly after realizing it. “It has more than the other cars. It’s much better.” </p><p>“You’d better go ask your mom, lord knows she makes the actual decisions around here.” You say as you lean over the cart reassuring your son that he’ll probably get it after talking to her. After a quick stroll through the overpriced electronics, you realize that you need permission to buy things as well, but that is besides the point. You have a family now. And when your boy returns it’s obvious why you are fine with that. </p><p>“She said that I could have this as long as you make her feel extra special later.” He says without knowing any context. “Can you do that so I can get it?” </p><p>“Well son, I hate to break it to you, and I’m sure you’ll figure this out when you’re a man, but sometimes. Well sometimes, those things just can’t happen. You know--”</p><p>“You mean, I can’t get the car?” </p><p>“You can get the car, I can’t guarantee anything else is all that I’m saying. Your old man is tired on his day off if you know what I mean. You don’t. So don’t worry about it. Put it in the cart.” You say to your flummoxed offspring. He has the innate quality of being half you, yet wholly his own being in those moments. Like a puzzled dog at the vet, he can’t seem to go through the right door. </p><p>“Honey, really? Cheese its?” Your wife says to you. She is wearing that blue sundress that you like, the one cut to show off her hips. With the right sunlight, on a autumn day, you might think she is the perfect woman. That is enough isn’t it. Nothing is perfect every day. And with the troubles she incurs on your life, nothing is perfect any day really. But the car is perfect. </p><p>“Honey, come look at this thing.” You say when you get home and observe the opened car on the kitchen table. Upon closer inspection you see what your son was talking about. It’s perfectly molded, perfectly colored. Fun. Rolls perfectly on the surface. “What is that model you think? Austin Martin?” Secretly thinking those Brits have all the best things in life. </p><p>“No that is a BMW honey. Don’t try to grease me either, I know what you make in a year.” </p><p>“I didn’t say I wanted one. We have a kid, he’s a walking BMW. Costs more probably.” You say as a smart retort to your wife, who isn’t as impressed as you are. “Oh yah, that is the BMW thing on the front.” </p><p>“Of course it is honey.” </p><p>Later that night, you’ll observe your son playing in his room with the car. Sprawled out on his stomach, making engine sounds that go “vroom vroom”. He is driving over the other toys he’s accumulated over the years, the GI Joes, the Matchbox cars, the remote control cars, and other things that extracted money from your wallet. It’s moments like this that reminds you of the joy of life. A child playing is the most careless action in the world.</p><p>“What the hell was that?! Honey wake up! Jesus.” You are shaken awake by your wife who has been startled by something coming down the hall. She has a concerned look, visible even over the diminished light from her side of the bed.</p><p>“What? Linda. What?” You say with a groggy rub to the head. “You realize I work tomorrow-” A shuffle down the hall. “What is that?” </p><p>“See,” she says. “Take the bat.” She is up next to the door now, peaking out the sliver that is still open for such an occasion. “Something just went into Danny’s room!” It went across the floor.” </p><p>You get out of the bed as you remove the gunk from your eye socket. “What is it?” You say, weary and unbalanced as you grab frantically for reality to join your vision. “What do you mean it’s in Danny’s room?” You open the door to your bedroom, your wife backing away as you do so. She follows you down the hall as you creep against the wall. Passing the bathroom, your son’s room is only another 6 feet on the right. His door is open, nightlight still on. </p><p>“Danny?” You say as you creak the door open. Your wife’s reaction outpaces yours. She runs in past you, screaming. Danny is on the floor. Bloodied on the forehead. Unconscious. Shock begins to set in. </p><p>Danny is sprawled out as your wife cradles his head and frantically screams and inspects his wounds. He isn’t holding anything and he’s wearing the same clothes, but with blood on the shirt. He is the same as he was a just before you went to bed. Same place on the floor. Toys laid out. Played with. Your wife is shaking looking to you for help and you do the best you can. Call the emergency number. Get towels for his head. But his eyes are closed. He is barely breathing and your more upset than reliable, as anyone would be.</p><p>“--Emergency, what is the nature of your emergency?” You say. </p><p>“My son has been. What looks like he’s been hit on the head. He is unconscious. Blood everywhere. We need help.” </p><p>“What happened sir?” </p><p>“I don’t know. I saw him playing tonight. He was fine. I wake up and he’s like this.” </p><p>“Sir, we have an ambulance in the area. Stay on the line. Is your son breathing?” </p><p>“No.” </p><p>“Vincent!” Your wife screams. You walked into the hall to give your wife some room and to make the call. Cords are a bitch. “Vincent!”</p><p>You drop the phone and run to her. She is over your son, holding his head, putting pressure on his wound. As you join her in the room you notice that behind her. On the dresser a stack of books are moving. Slowly inching toward the edge and your wife. They are being pushed by something just out of view. And as you run toward your wife and son they fall, hitting your wife on the head as she is grasping at Danny and motioning for you. She doesn’t see the books coming, but she feels them as they hit the back of her head and she falls forward. </p><p>You cling to her body as you feel the lifeless pose of a rag doll in your hands. She moves without muscles, loose and her head rests at an indescribable angle on your shoulder. She is unconscious too, and yelling honey into her ears has no effect. The large books managed to fall quite a distance from the dresser, hitting your wife in the head at enough speed and velocity to knock her out. At such a distance this wasn’t just the fall. Something pushed them with force. </p><p>You stand up and notice nothing atop the dresser. Looking around is no help. The distant voice on the other end of the dispatch line is all that you hear when you suddenly hit the ground, or more precisely your wife’s legs. Something took your legs out from under you. You look down to notice your ankles are tied with a crude string that itself is attached to the corner leg of the dresser. </p><p>You head is bloodied, your back is pained from the fall, and your neck is strained from your wife’s shins. You look up to see the moment before the dresser collapses on you, pulled down by the weight of your own fall. It hovered for a moment, defying gravity and you tried to wiggle from its fall but that just accelerated its downfall. As it comes down on you, you think back to earlier that night, first when you saw your son playing on the floor. Then when you made love to your wife. Those aren’t bad moments leave on. </p><p>But before you go. As your lying there, with the dresser on top of you. As you’re spitting blood, and seeing doubles. You notice movement coming into your vision. Then red. It’s coming closer, but still not clear. It’s only when the red toy car comes up to within an inch of your eyes that you see it. See into it, and all that it did. </p><p>The police report would classify these deaths as accidental. When Darren got to work the next day at AFPK, he heard about his brother, Vincent, his sister-in-law, Linda, and his bright young nephew, Danny.</p><a href='#/fiction'>fiction</a>"
  },
  {
    "title": "The Encounter",
    "date": "July 18, 2015",
    "body": "<p>It was a long time since he had communications with Earth. Two weeks to be precise. In that time he had learned nothing about himself, which was disappointing to him. “Why else do I lose comms a million miles from another living sole?” he thought.</p><p>He went on for weeks this way. Life support systems were the only fully functional systems on his craft, which should have been message enough for him. The craft’s stores of perishables could last as long as his mind could foresee. It was an ironic thing, pondering his own doom while he clung to a life raft drifting the ocean of black. He had not considered this fate, yet it was remarkably comforting to him. He knows the ending. </p><p>To pass the time he took up any minimal work he could conceive of, cleaning, checking subsystems, trying to diagnose the various problems he could not possibly solve. His record against the onboard computer in chess was improving. No one will have to know that he lowered the difficulty. As he could neither send nor receive transmissions he took to conversing with himself. Don’t take that as the ravings of a lunatic. He had no one else. </p><p>It was by chance that he found the files that were received immediately before the catastrophe. A mix of audio, video and text messages from his and the assumed deceased crew members, families.</p><p>“Hi daddy. Today is a Tuesday so by the time I get your reply next week I’ll already know how the play goes. I’m scared. A lot of people will be there. It’s the one time that I’m in costume and everyone can actually see it. Marty says that I will be the best one in my scenes, but he hasn’t seen it yet and doesn’t know. I wish you were here. I need you to swing me when you get home. Mom can’t get me as high as you can. </p><p>Bobby goes on for another 7 minutes before he closes the file. The falling water in his stomach is not helpful. He can only imagine his son on the stage. His nervous cracked voice riding over the audience of parents and apprehensive older siblings. He’ll save his wife’s files for later. He needs some food and can’t remember where the bourbon was hidden. Maybe that was jettisoned along with the rest of the crew. Another cruel irony he thought to himself, they don’t even need it.</p><p>The next day he watched his daughter’s video recording. </p><p>“Hi dad. Bobby talked to you earlier, and I’m sure you’re exhausted from that. But let me give you a few more minutes. I know you’re out there. I can’t see you and mom talks about you like you’re never coming home. It’s only been six months. She talks to you all the time. I don’t know why she says things like that. Grandma keeps coming by and they are up every night smoking in the dining room. I can hear them coughing until late. I know you’re coming back. Your mission is to come back. It’s just. Tom says that over three fourths the way there and it feels like the longest time since I’ve seen you. </p><p>It did feel long. But then it was a relative term.</p><p>“I really miss you dad. I want you to come home. We all want you to come home. I think this one has to be the last time you do a mission. We love you. We miss you.</p><p>He knew what this meant to her. He was on the tail end of an astronauts career. The riley veteran in every meeting. The training lead in every simulation and mission. Not that the thrill was gone, but thinking about all the time he had been drifting in space he wondered what it was all for. Something greater? </p><p>His answer came two months later in the middle of a game of checkers. He had just kinged his final piece. An alarm started for the botanical bay on the far end of the ship. He exited the artificial gravity capsule near the living quarters and swam toward the back of the ship. He passed the numerous corridors leading to various experimental labs and zero gravity systems. His suit was bulky and probably unnecessary, but he didn’t know the nature of the alarm until he reached the lock. He peered through the glass. Nothing.</p><p>Opening the hatch he cautiously entered the chamber. From its high ceilings hung rows and rows of plants stacked neatly and precisely inches from the row above. He approached the center of the chamber following the library shelf. It was difficult to look through the columns, but he immediately spotted a flicker of wavering light, and an unpleasant thickness of the air. Indeed as he went further towards to the corner of the chamber he encountered the blaze. </p><p>A fire in low gravity is remarkably hard to extinguish, and his training failed to anticipate so many malfunctioning systems. It took him nearly five hours to fight this rather small fire. No one does indeed hear you scream in space. In this case they don’t hear yelling and profanity either.</p><p>When he finally went back to the living quarters and returned his suit to the anti-chamber, he noticed it. A blinking speck on the telemetry computer. An eminent collision warning. He was, although unpowered, still in a ship in very fast motion. His first thought was to question why the computer hadn’t calculated this collision sooner, in the longer range calculations. Numerous possibilities, the least of which was a malfunctioning mainframe, didn’t help his cause at the moment. He was by the screens testament only thirty minutes to impact. </p><p>Fifteen minutes to impact. He checked every system in propulsion for a small chance to avert course.</p><p>Ten minutes to impact. Hurriedly peppered the computer system with questions of system’s integrities. Non-nominal.</p><p>Five minutes to impact. He pulled the straps on the captains chair around his chest, a promotion from mission specialist, but no one would care.</p><p>Counting down from one minute to impact. He saw the object growing on his computer’s readout. It was approximately twice the size of his ship, traveling at roughly at roughly the same speed, on a direct course with his vessel. </p><p>Twenty two seconds to impact. The object began to slow it’s velocity, an impossible piece of information. A glitch in the system. The collision warning relented at ten seconds to impact. The object had matched his velocity and was approximately one hundred meters directly above his ship. One hundred meters and closing.</p><p>He felt the first impact. The sound of rocks hitting one another echoed through the ship to his suit. It was a jolt to his chair. He unbuckled and walked to the observation windows to his right. He lied down turned face up to the ceiling. </p><p>There it was. A remarkably simple craft with no lights or insignia. It engulfed the background of stars with a metallic matte black that was darker than the emptiness behind. It had smooth curves and lacked any real angles of any kind. The full length of his view was obstructed by the craft, which was a long cylindrical shape.</p><p>A light overtook him and his ship. He covered his eyes and remarked how stereotypical it would sound in his report. When it subsisted, he removed his arm hiding his eyes. When his focus was retained, he was staring clearly at the Atlantic ocean. The blue marble spinning beautifully under him. A quarter of a light year in seconds. He heard the communications from Earth cut into his earpiece by the captain’s console. </p><a href='#/fiction'>fiction</a>"
  },
  {
    "title": "That is Life",
    "date": "November 28, 2011",
    "body": "<p>Rachel walks from her car toward the home she grew up in all those years ago. Her new car goes along with her burgeoning career and new husband. The house is familiar to her, each stone holding the same memory it did when she was a young girl. Running in the back with freshly picked daisies. Tossing the warm cookie from hand to hand. Finding the dying turtle, head limply falling from the shell, and then asking her mom what was happening. </p><p>“Sweetie.” Her mom said with a reassuring smile. “That is life.” The brunette hair of her mother’s warm face covered one of her bright green eyes. Standing on the back porch, with the dying turtle in her hand, her mother had a presence in that moment that hadn’t been surpassed. </p><p>Rachel walks to the white front door on the porch with the old rocking chair still moving in the wind. When she reaches the door, it opens a second before her hand reaches the handle. </p><p>“Rachel.” Robert, her mother’s nurse, says as he is there to greet her. “It’s good that you came.” </p><p>“I came as soon as I heard.” Rachel replies as she walks through the door into the hallway. It’s smaller than Rachel’s new home in the city, but like most old homes it isn’t hurt by the size. It is still as it always was in those old memories; the same nightstand by the entrance.The same walkway into the living room. Kitchen through the door below the staircase, same as it was. </p><p>“I’m so glad you were able to come. This is a good day. A very good day.” Robert says as he wipes a tear from his eye. The two hug and Rachel asks him how her mother is doing. The two are standing just inside the house as Robert closes his eyes, lowers his head, and nods. </p><p>“It’s okay. I’ll be fine.” Rachel says, reassuring Robert with another hug. “Where is she?” </p><p>“She said she wanted to do some reading on the couch in the living room. I’ll be in the kitchen if you need me.” </p><p>Rachel walks into the living room and doesn’t notice her mother at first under the blankets as her mother’s eyes are closed and the scarf covering her head blends in with the white couch. It is the same couch that, twenty years earlier, Rachel received a memorable discussion of sex on. Those same cushions that comforted her many nights of watching <i>Night of the Living Dead</i> while babysitting, reading for school, or kissing William Flenton back in the summer of ‘76. </p><p>Her mother is stretched out on the couch, the book collapsed on her chest. Head toward the back. She is sleeping as Rachel kneels beside the white headrest, placing her keys on the table beside it. The clink causes her mother to awake. Her green eyes stutter open, head turning toward Rachel.</p><p>	“Rachel!” Her mother immediately says upon realizing who is there. She outstretches her arms but doesn’t lean forward much before wincing back in pain. Rachel obliges her mother by embracing the frail woman as gently as possible. </p><p>“Hi, mom.” </p><p>“When is Eddie coming home?” Her mom queries, as she puts the book on the table just beside Rachel.</p><p>Rachel smiles and says, “Mom, dad is gone.” </p><p>“Where did he go? The store? I was just reading a book. I saw him this morning.”</p><p>“No, mom, he’s been gone for years.” Rachel says touching her mother’s shoulder reassuringly. </p><p>“Oh.” Her mom says. “I’m sorry. How are you, how is school doing?” </p><p>“I got out of school mom, I’m working now. At the firm with Michael, remember? We got married?” </p><p>“Oh right. He is a good man. Reminds me of Eddie.” </p><p>“That’s why I married him.” </p><p>“I’m sorry again.” </p><p>“Don’t say you’re sorry. You have nothing to be sorry for.” Rachel laughs softly. “So, how are you doing?” </p><p>“I forget things now. I’m sorry.” Her mother says raising her head a little higher on the couch. </p><p>“Well, let me tell you a story. Something that happened to me recently.” </p><p>“Oh, what happened?” Her mother says coughing. </p><p>“I met this man. And my heart just stopped. I mean. Time stopped and all around us was standing still. He introduced himself and said that he liked what I was wearing. I smiled and blushed but with him-- With him. He made me comfortable. Like no one else ever has, except for you, and maybe this old couch.” Rachel laughs along with her mother as she points to the withering couch. </p><p>“He was such a nice man. We went out a few times, and--” Rachel begins to choke up. “We got married. It was a great time. Both our families were there and he danced for the first time ever and fell down, and everyone laughed and cried because he was so nice. Tall, awkward man sometimes. He ran into that swing set he built. And he always came home with a smile. When the war came, and he was sent off I remember crying at the docks. Just falling on the ground crying. But seeing him again was the best moment of my life. He came running through the gates, dropping his gear as he did. He was wounded, but not in that moment. Because we had years together yet to live. When he died, I remember holding his hand. Him grasping harder as he passed.” </p><p>“That is a nice story. What was his name?” Her mother says gasping for air. Panting harder with each second. </p><p>“Mom. That wasn’t me.” Rachel replies, heart racing.</p><p>	“No?”</p><p>“No mom. That was <i>you</i>. It wasn’t me. That was you and dad.” </p><p>“Thank you for that. I know now. I can almost see him.” </p><p>Later that night, Rachel’s mom passed away, surrounded by people telling her they loved her. Rachel, through her immediate shock and sadness, remembered what her mom said to her, “That is life.”</p><a href='#/fiction'>fiction</a>"
  },
]
